Repository: arantxahdezb/Coronado
Catalog: web/sites/default/files/translations/db_maintenance-2.0.0.*.po
Languages: es

source: Optimize tables
es: Optimizar tablas

source: Database tables optimized
es: Tablas de Base de Datos optimizadas

source: If enabled, a watchdog entry will be made each time tables are optimized, containing information which tables were involved.
es: Si está habilitado, un registro de watchdog se hará cada vez que las tablas se optimicen, conteniendo información de las tablas implicadas.

source: Hourly
es: Cada hora

source: Daily
es: Diariamente

source: Weekly
es: Semanalmente

source: Monthly
es: Mensualmente

source: Select how often database tables should be optimized.
es: Seleccione la frecuencia con la que las tablas de base de datos deben ser optimizadas.

source: Optimize now.
es: Optimizar ahora.

source: Selected tables will be optimized during cron runs.
es: Las tablas seleccionadas seran optimizadas en cada ejecucion de cron.

source: DB Maintenance
es: Mantenimiendo de BD

source: Settings
es: Configuración

source: Other
es: Otro(s)

source: Run during every cron
es: Durante cada ejecución de cron

source: Bi-Hourly
es: Bi-Cada hora

source: Bi-Daily
es: Bi-Cada día

source: Bi-Weekly
es: Bi-Cada semana

source: Bi-Monthly
es: Bi-Cada mes

source: Executes a cron-based query to optimize database tables.
es: Ejecuta una consulta basada en cron para optimizar las tablas de bases de datos.

source: About
es: Acerca de

source: Uses
es: Usos

source: DB Maintenance performs an optimization query on selected tables
es: Mantenimiento de DB realiza una consulta de optimización en tablas seleccionadas

source: MyIASM Tables
es: Tablas de MyIASM

source: OPTIMIZE TABLE repairs a table if it has deleted or split rows, sorts table indexes, and updates table statistics. For BDB and InnoDB, OPTIMIZE rebuilds the table.
es: OPTIMIZE TABLE repara una tabla si han eliminado o dividido filas, ordena índices de la tabla, y actualiza las estadísticas de la tabla. Para InnoDB y BDB OPTIMIZE reconstruye la tabla.

source: OPTIMIZE works best on tables with large deletions (e.g. cache or watchdog), however, MySQL will reuse old record positions, therefore in most setups, OPTIMIZE TABLE is unnecessary unless you just like defragmenting.
es: OPTIMIZE funciona mejor en las tablas con grandes eliminaciones (por ejemplo cache o watchdog) sin embargo, MySQL reutilizará posiciones de registros viejos, por lo tanto en la mayoría de las configuraciones, OPTIMIZE TABLE es innecesaria al menos que desee hacer algo parecido a una desfragmentación.

source: The Overhead column in phpMyAdmin's database view is the most common way to determine the need of an OPTIMIZE TABLE query. It essentially shows the amount of disk space you would recover by running an optimize/defragmentation query.
es: La columna de arriba en la vista de la base de datos de phpMyAdmin es la forma más común para determinar la necesidad de una consulta de OPTIMIZE TABLE. Esencialmente, muestra la cantidad de espacio en disco que recuperaría por ejecutar una consulta de optimizar/desfragmentación.

source: Note: MySQL locks tables while OPTIMIZE TABLE is running.
es: Nota: MySQL bloquea las tablas mientras se ejecuta OPTIMIZE TABLE.

source: Postgre SQL Tables
es: Tablas Postgre SQL

source: VACUUM reclaims storage occupied by deleted tuples. In normal PostgreSQL operation, tuples that are deleted or obsoleted by an update are not physically removed from their table; they remain present until a VACUUM is done. It's therefore necessary to VACUUM periodically, especially on frequently-updated tables.
es: VACUUM recupera el almacenamiento ocupado por eliminación de tuplas. En la operación normal de PostgreSQL, las tuplas eliminadas o sustituidas por una actualización no se eliminan físicamente de la tabla; siguen presentes hasta que se realiza un VACUUM. Por lo tanto es necesario realizar un VACUUM periódicamente, especialmente en las tablas que son actualizadas con frecuencia.

source: Optimize all tables
es: Optimizar todas las tablas

source: Automatically optimize all tables in the database(s) without having to select them first.
es: Optimizar automáticamente todas las tablas de la base de dato(s) sin tener que seleccionarlas.

source: Administer DB Maintenance
es: Administrar Mantenimiento DB

source: Select which tables to optimize during cron jobs.
es: Seleccione las tablas para optimizar durante trabajos de cron.
